# HostForCutHasNoGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..HostForCutHasNoGeometry Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Host can't be cut because it has no geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostForCutHasNoGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostForCutHasNoGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostForCutHasNoGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace